{
  "backend/main.mo": "Main Motoko actor implementing a social platform backend with user profiles, posts (with categories and virtual prototypes), likes, comments, investment ratings, and access control/blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (authentication, post creation, feed view, filtering, likes, investment ratings, comments) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend TypeScript/React files covering components, pages, hooks, and styling for the Neon Genesis social platform.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light/dark theme variables including neon accent colors (green, blue, pink) for the application.",
  "frontend/index.html": "HTML entry point for the Neon Genesis React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for feed, create post, and post detail pages, wrapped in ThemeProvider with dark mode and toast notifications.",
  "frontend/src/components/CategoryFilter.tsx": "Category filter component rendering clickable badges for All, Environmental, Disaster Relief, and Sustainable Infrastructure with neon gradient styling for active state.",
  "frontend/src/components/CommentSection.tsx": "Comment section component displaying scrollable comment list with avatars/timestamps and authenticated comment submission form with real-time updates.",
  "frontend/src/components/CreatePostForm.tsx": "Form component for creating new posts with title, description, category selection, and optional virtual prototype (image URL and description). Handles form submission and navigation after successful post creation.",
  "frontend/src/components/InvestmentRating.tsx": "Displays three investment rating buttons (Diamond, Blue Sapphire, Red Ruby) with icons and counts. Allows authenticated users to rate posts with different investment interest levels.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with sticky header containing logo, navigation, create button, and login button. Includes footer with attribution and copyright information.",
  "frontend/src/components/LikeButton.tsx": "Heart-shaped like button component that toggles between liked/unliked states. Requires authentication and updates like count with visual feedback.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout. Clears query cache on logout and manages login state with loading indicators.",
  "frontend/src/components/PostCard.tsx": "Card component displaying post summary with author info, category badge, title, description, optional prototype image, investment ratings, like button, and comment count. Navigates to full post on click.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that appears for authenticated users without profiles, prompting them to enter name (required) and email (optional) to complete profile setup.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state. Invalidates dependent queries when actor changes and handles admin token initialization.",
  "frontend/src/hooks/useAddComment.ts": "Mutation hook for adding comments to posts. Invalidates comment queries for the specific post after successful comment addition.",
  "frontend/src/hooks/useAddInvestmentRating.ts": "Mutation hook for adding investment ratings to posts. Invalidates post queries after successful rating submission.",
  "frontend/src/hooks/useCreatePost.ts": "Mutation hook for creating new posts with title, description, category, and optional virtual prototype. Invalidates posts query after successful creation.",
  "frontend/src/hooks/useGetAllPosts.ts": "React Query hook that fetches all posts from the backend actor, enabled only when the actor is available.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile, with custom loading states that account for actor initialization.",
  "frontend/src/hooks/useGetComments.ts": "React Query hook that fetches comments for a specific post by postId, returning an empty array if actor is unavailable.",
  "frontend/src/hooks/useGetPost.ts": "React Query hook that fetches a single post by postId, returning null if the post is not found or actor is unavailable.",
  "frontend/src/hooks/useGetPostsByCategory.ts": "React Query hook that fetches posts filtered by a specific category, enabled only when actor is ready.",
  "frontend/src/hooks/useGetUserProfile.ts": "React Query hook that fetches a user profile by Principal, enabled only when both actor and principal are available.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useLikePost.ts": "React Query mutation hook that likes a post and invalidates related post queries on success.",
  "frontend/src/hooks/useQueries.ts": "Consolidated file containing all React Query hooks for user profiles, posts, likes, unlikes, comments, and investment ratings with query invalidation logic.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook that saves the current user's profile and invalidates the currentUserProfile query on success.",
  "frontend/src/hooks/useUnlikePost.ts": "React Query mutation hook that unlikes a post and invalidates related post queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a dark-themed neon aesthetic, including color variables for green, blue, and pink neon accents.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/CreatePostPage.tsx": "Protected page component that renders a post creation form for authenticated users and redirects unauthenticated users to the home page.",
  "frontend/src/pages/FeedPage.tsx": "Main feed page displaying a hero banner, category filter, and grid of post cards with loading states and empty state handling.",
  "frontend/src/pages/PostDetailPage.tsx": "Detailed post view page showing post content, author info, category badge, like button, investment rating, and comment section with loading and not-found states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space (including neon colors, sidebar, chart colors), container settings, border radius variables, custom shadows, and animation keyframes.",
  "project_state.json": "Project state file for Neon Genesis, a social platform for sharing sustainable/environmental ideas with a three-tier investment rating system (diamond/sapphire/ruby), featuring user authentication, post creation, feed views, likes, comments, and Instagram-inspired UI."
}